## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_network_security_group.test will be created
  + resource "azurerm_network_security_group" "test" {
      + id                  = (known after apply)
      + location            = "polandcentral"
      + name                = "sg-tf-github"
      + resource_group_name = "rg-tf-github"
      + security_rule       = (known after apply)
    }

  # azurerm_private_endpoint.example will be created
  + resource "azurerm_private_endpoint" "example" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "polandcentral"
      + name                     = "pe-tf-github"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-tf-github"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "test_psc"
          + private_connection_resource_id = "/subscriptions/e137701d-3884-4623-b52e-f99f4eb32aac/resourceGroups/rg-tf-github/providers/Microsoft.Storage/storageAccounts/ngp3ylbmqinl1tkf1147s36j"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_storage_account.example will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
      ~ account_replication_type           = "LRS" -> "GRS"
      ~ allow_nested_items_to_be_public    = true -> false
        id                                 = "/subscriptions/e137701d-3884-4623-b52e-f99f4eb32aac/resourceGroups/rg-tf-github/providers/Microsoft.Storage/storageAccounts/ngp3ylbmqinl1tkf1147s36j"
        name                               = "ngp3ylbmqinl1tkf1147s36j"
      ~ public_network_access_enabled      = true -> false
      ~ shared_access_key_enabled          = true -> false
        tags                               = {
            "Environment" = "development"
        }
        # (93 unchanged attributes hidden)

      ~ blob_properties {
            # (5 unchanged attributes hidden)

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              + "Metrics",
                # (1 unchanged element hidden)
            ]
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/e137701d-3884-4623-b52e-f99f4eb32aac/resourceGroups/rg-tf-github/providers/Microsoft.Network/virtualNetworks/vn-tf-github/subnets/subnet-tf-github",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ queue_properties {
          ~ logging {
              ~ delete                = false -> true
              ~ read                  = false -> true
              ~ retention_policy_days = 0 -> 10
              ~ write                 = false -> true
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }

        # (1 unchanged block hidden)
    }

  # azurerm_subnet.common will be destroyed
  # (because azurerm_subnet.common is not in configuration)
  - resource "azurerm_subnet" "common" {
      - address_prefixes                               = [
          - "10.0.2.0/24",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/e137701d-3884-4623-b52e-f99f4eb32aac/resourceGroups/rg-tf-github/providers/Microsoft.Network/virtualNetworks/vn-tf-github/subnets/subnet-tf-github" -> null
      - name                                           = "subnet-tf-github" -> null
      - private_endpoint_network_policies              = "Enabled" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "rg-tf-github" -> null
      - service_endpoints                              = [
          - "Microsoft.Sql",
          - "Microsoft.Storage",
        ] -> null
      - virtual_network_name                           = "vn-tf-github" -> null
    }

  # azurerm_subnet.test will be created
  + resource "azurerm_subnet" "test" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "sub-tf-github"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-tf-github"
      + service_endpoints                              = [
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vn-tf-github"
    }

  # azurerm_subnet_network_security_group_association.test will be created
  + resource "azurerm_subnet_network_security_group_association" "test" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>